In [1]:
#pivot allows us to transform or reshape data
# In pandas, we use a pivot table to summarize, reshape, and analyze data by converting raw (long-format) data into a meaningful aggregated table
import pandas as pd
df = pd.read_csv("weather.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [8]:
# we can chage our x-axies and our y-axes with the help of pivot
# pivot alway want two parameter index and columns
df.pivot(index="date", columns = "city")

         temperature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
5/1/2017          80     75       65       26     80       56
5/2/2017          77     78       66       30     83       58
5/3/2017          79     82       68       35     85       60

In [9]:
# only humidity i want then
df.pivot(index="date", columns = "city", values = "humidity")

city      beijing  mumbai  new york
date
5/1/2017       26      80        56
5/2/2017       30      83        58
5/3/2017       35      85        60

In [ ]:
# -----------------------------------------**** Pivot Table ****---------------------------------------------

In [10]:
#pivot table is used to summarize and aggregate data inside dataframe
df = pd.read_csv("weather2.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

In [13]:
df.pivot_table(index="date", columns = "city")
# now this will gige the average of two number on the same date

         humidity          temperature
city       mumbai new york      mumbai new york
date
5/1/2017     81.5     55.0        76.5     63.0
5/2/2017     55.5     61.0        81.0     71.0

In [19]:
# we can also get sum, max, min - defoult is mean
df.pivot_table(index="date", columns = "city", margins = True)

         humidity                 temperature
city       mumbai new york    All      mumbai new york     All
date
5/1/2017     81.5     55.0  68.25       76.50     63.0  69.750
5/2/2017     55.5     61.0  58.25       81.00     71.0  76.000
All          68.5     58.0  63.25       78.75     67.0  72.875

In [20]:
df = pd.read_csv("weather3.csv")
df

        date      city  temperature  humidity
0   5/1/2017  new york           65        56
1   5/2/2017  new york           61        54
2   5/3/2017  new york           70        60
3  12/1/2017  new york           30        50
4  12/2/2017  new york           28        52
5  12/3/2017  new york           25        51

In [ ]:
# we can also find the average of any mounth
# here we are using grouper funtion

In [25]:
# to change in date in a  table we have to conver date string - date 
df['date'] = pd.to_datetime(df['date'])
df

        date      city  temperature  humidity       data
0 2017-05-01  new york           65        56 2017-05-01
1 2017-05-02  new york           61        54 2017-05-02
2 2017-05-03  new york           70        60 2017-05-03
3 2017-12-01  new york           30        50 2017-12-01
4 2017-12-02  new york           28        52 2017-12-02
5 2017-12-03  new york           25        51 2017-12-03

In [26]:
type(df['date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [27]:
# average temp in the month of may and dec 
df.pivot_table(index = pd.Grouper(freq = 'M', key = 'date'), columns = 'city')

C:\Users\abhiraj\AppData\Local\Temp\ipykernel_20492\3758334708.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  df.pivot_table(index = pd.Grouper(freq = 'M', key = 'date'), columns = 'city')

                 data   humidity temperature
city         new york   new york    new york
date
2017-05-31 2017-05-02  56.666667   65.333333
2017-12-31 2017-12-02  51.000000   27.666667

In [ ]:
#it was give us the value in end date of may and end date of dec